CaseFolder/Fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0513 0 0);

boundaryField
{
    inlet
    {
//        type            fixedValue;
//        value           uniform (0.513 0 0);
       type            uniformFixedValue;
        uniformValue    table
        (
            (0    (0.0513  0 0))
            (0.2  (0.513   0 0))
        );
    }

    outlet
    {
        type            zeroGradient;
    }
    
    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
    }
        
    upperWall
    {
        type            noSlip;
    }
    
    lowerWall
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
