CaseFolder/Fluid/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    internalWall;

        patches
        {
            master
            {
                name            flap;
                type            wall;

                patchFields
                {
                /*------
                    p
                    {
                        type            zeroGradient;
                    }

                    U
                    {
                        type            movingWallVelocity;
                        value           uniform (0 0 0);
                    }

                    phi
                    {
                         type            calculated;
                         value           uniform 0;
                    }

                    pointDisplacement
                    {
                         type            fixedValue;
                         value           uniform (0 0 0);
                    }
                -----*/
                }
            }
            slave
            {
                name            flap;
                type            wall;

                patchFields
                {
                    $master.patchFields;
                }
            }
        }
    }
}
