CaseFolder/Fluid/system/fieldMinMax
fieldMinMaxP
{
    type        fieldMinMax;
    libs        ("libfieldFunctionObjects.so");
    writeToFile yes;
    log         no;
    location    yes;
    mode        magnitude;
    fields      ( p );
}

fieldMinMaxU
{
    type        fieldMinMax;
    libs        ("libfieldFunctionObjects.so");
    writeToFile yes;
    log         no;
    location    yes;
    mode        magnitude;
    fields      ( U );
}
