CaseFolder/Fluid/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type        forces;

    libs ( "libforces.so" );

    writeControl   timeStep;
    timeInterval    1;

    log         yes;

    patches     (flap);
   	pName               p;
   	UName               U;
   	rhoName             rhoInf;
    rho         rhoInf;      // Indicates incompressible
    rhoInf      1.18;           // Redundant for incompressible
    CofR        (0 0 0);  // Axle midpoint on ground
}


// ************************************************************************* //
