CaseFolder/Fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           1.0e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

//    "(U|cellDisplacement)"
    U
    {
    /*----
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    -----*/
    //*----
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-4;
    //-----*/
    }

//    "(U|cellDisplacement)Final"
    UFinal
    {
        $U;
        relTol          0;
    }

    cellDisplacement
    {
    /*----
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    -----*/
    //*----
        solver          PBiCGStab;
        preconditioner  DIC;//DILU;//DILUだとエラーが出る。
        tolerance       1e-06;
        relTol          1e-4;
    //-----*/
    }    
    cellDisplacementFinal
    {
        $cellDisplacement;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    // tolerance 1.0e-14;
    // relTol 5e-3;
    consistent  true;
    correctPhi  true;
    momentumPredictor true; 
    nOuterCorrectors	2;//1;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    ".*Final"       1;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}



// ************************************************************************* //
