CaseFolder/Fluid/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
	probes 
	{ 
		writeControl	timeStep;
		writeInterval	1;

		type probes; // Type of functionObject 
		// Where to load it from (if not already in solver) 
		libs ("libsampling.so"); 

	 	log         yes;

		probeLocations // Locations to be probed. runTime modifiable! 
		( 
			( 0.015 -0.01 0.0) 
			( 0.015  0.01 0.0) 
		); 
		// Fields to be probed. runTime modifiable! 
		fields 
		( 
			p 
			U 
		); 
	} 

