CaseFolder/Fluid/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        name    internalWall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.5e-3 -0.1e-3 -0.1) (40.1e-3 0.1e-3 0.1);
        }
    }
    {
        name    internalWall;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet internalWall;
        }
    }
);
